content/postgressql.org
#+Title: Postgresql
#+OPTIONS: num:nil
#+STARTUP: overview
* basic OP
** install
sudo apt install postgresql postgresql-contrib
** root terminal
this terminal ist not sufficient to program, but basic shell command can be executed
login into terminal: 
sudo -i -u postgres
terminal to psql:
psql
** root login into database
sudo -i -u postgres psql(postgres:  default user)
psql, login into psql user
if we login, we will be located in a table, which have the same name with user
** user login
psql -d test -U si -W
** set password
in database set password for user
\password user
** change database
\c database
** list all users
\du
** login out
\q

* src block
** with header
#+header: :engine postgresql
#+header: :dbhost 141.5.103.10
#+header: :dbuser postgres
#+header: :dbpassword "du"
#+header: :database postgres
#+begin_src sql 
create table personv (
 id int, 
 firstname varchar(50),
 lastname varchar(50),
 gender varchar(6),
 dataofbirth DATE
) ;
#+end_src
#+RESULTS:
|---|
** with session
#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword ich :database postgres :dbport 5432
\l
#+end_src

#+RESULTS:
| List of databases     |          |          |             |             |                   |
|-----------------------+----------+----------+-------------+-------------+-------------------|
| Name                  | Owner    | Encoding | Collate     | Ctype       | Access privileges |
| postgres              | postgres | UTF8     | zh_CN.UTF-8 | zh_CN.UTF-8 |                   |
| si                    | postgres | UTF8     | zh_CN.UTF-8 | zh_CN.UTF-8 |                   |
| template0             | postgres | UTF8     | zh_CN.UTF-8 | zh_CN.UTF-8 | =c/postgres       |
| postgres=CTc/postgres |          |          |             |             |                   |
| template1             | postgres | UTF8     | zh_CN.UTF-8 | zh_CN.UTF-8 | =c/postgres       |
| postgres=CTc/postgres |          |          |             |             |                   |
| test                  | postgres | UTF8     | zh_CN.UTF-8 | zh_CN.UTF-8 |                   |

#+begin_src sql :engine postgresql :dbhost localhost :dbuser postgres :dbpassword ich :database postgres :dbport 5432
\d 
#+end_src

#+RESULTS:
| List of relations |         |       |          |
|-------------------+---------+-------+----------|
| Schema            | Name    | Type  | Owner    |
| public            | person  | table | si       |
| public            | personv | table | postgres |
