postgressql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-24 Fri 12:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Postgresql</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Postgresql</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org59d4636">1. basic OP</a>
<ul>
<li><a href="#orgfaeaaa7">1.1. install</a></li>
<li><a href="#orgf11f71c">1.2. root terminal</a></li>
<li><a href="#org355a691">1.3. root login into database</a></li>
<li><a href="#org0014e04">1.4. user login</a></li>
<li><a href="#org450f0f1">1.5. set password</a></li>
<li><a href="#orgb9ee73d">1.6. change database</a></li>
<li><a href="#org107cb73">1.7. list all users</a></li>
<li><a href="#org871d332">1.8. login out</a></li>
</ul>
</li>
<li><a href="#orged8340c">2. src block</a>
<ul>
<li><a href="#org15cca42">2.1. with header</a></li>
<li><a href="#org2195e72">2.2. with session</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org59d4636" class="outline-2">
<h2 id="org59d4636"><span class="section-number-2">1</span> basic OP</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfaeaaa7" class="outline-3">
<h3 id="orgfaeaaa7"><span class="section-number-3">1.1</span> install</h3>
<div class="outline-text-3" id="text-1-1">
<p>
sudo apt install postgresql postgresql-contrib
</p>
</div>
</div>
<div id="outline-container-orgf11f71c" class="outline-3">
<h3 id="orgf11f71c"><span class="section-number-3">1.2</span> root terminal</h3>
<div class="outline-text-3" id="text-1-2">
<p>
this terminal ist not sufficient to program, but basic shell command can be executed
login into terminal: 
sudo -i -u postgres
terminal to psql:
psql
</p>
</div>
</div>
<div id="outline-container-org355a691" class="outline-3">
<h3 id="org355a691"><span class="section-number-3">1.3</span> root login into database</h3>
<div class="outline-text-3" id="text-1-3">
<p>
sudo -i -u postgres psql(postgres:  default user)
psql, login into psql user
if we login, we will be located in a table, which have the same name with user
</p>
</div>
</div>
<div id="outline-container-org0014e04" class="outline-3">
<h3 id="org0014e04"><span class="section-number-3">1.4</span> user login</h3>
<div class="outline-text-3" id="text-1-4">
<p>
psql -d test -U si -W
</p>
</div>
</div>
<div id="outline-container-org450f0f1" class="outline-3">
<h3 id="org450f0f1"><span class="section-number-3">1.5</span> set password</h3>
<div class="outline-text-3" id="text-1-5">
<p>
in database set password for user
\password user
</p>
</div>
</div>
<div id="outline-container-orgb9ee73d" class="outline-3">
<h3 id="orgb9ee73d"><span class="section-number-3">1.6</span> change database</h3>
<div class="outline-text-3" id="text-1-6">
<p>
\c database
</p>
</div>
</div>
<div id="outline-container-org107cb73" class="outline-3">
<h3 id="org107cb73"><span class="section-number-3">1.7</span> list all users</h3>
<div class="outline-text-3" id="text-1-7">
<p>
\du
</p>
</div>
</div>
<div id="outline-container-org871d332" class="outline-3">
<h3 id="org871d332"><span class="section-number-3">1.8</span> login out</h3>
<div class="outline-text-3" id="text-1-8">
<p>
\q
</p>
</div>
</div>
</div>

<div id="outline-container-orged8340c" class="outline-2">
<h2 id="orged8340c"><span class="section-number-2">2</span> src block</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org15cca42" class="outline-3">
<h3 id="org15cca42"><span class="section-number-3">2.1</span> with header</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">create</span> <span style="font-weight: bold;">table</span> <span style="font-weight: bold;">personv</span> (
 id <span style="font-weight: bold; text-decoration: underline;">int</span>, 
 firstname <span style="font-weight: bold; text-decoration: underline;">varchar</span>(50),
 lastname <span style="font-weight: bold; text-decoration: underline;">varchar</span>(50),
 gender <span style="font-weight: bold; text-decoration: underline;">varchar</span>(6),
 dataofbirth <span style="font-weight: bold; text-decoration: underline;">DATE</span>
) ;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2195e72" class="outline-3">
<h3 id="org2195e72"><span class="section-number-3">2.2</span> with session</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sql">\l
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">\d 
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-06-24 Fri 12:19</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
